IP = "173.1.0.25"  # TODO: поменять айпишник на айпишник малины, которая будет стоять на роботе
PORT = 8000

SEND_DELAY = 0.05  # время задержки отправки новых данных
# TURN_STICK = 'z'  # имя поворотного стика(передняя часть робота)
# ROTATE_STICK = 'y'  # имя стика разворота на месте
# MOVE_STICK = 'rz'  # имя стика движения робота
# SPEED_CHANGE_STEP = 10  # размер шага изменения максимальной, при прибавлении или уменьшении с кнопки
# ADD_SPEED_BUTTON = 'pinkie'  # имя кнопки прибавления скорости
# SUB_SPEED_BUTTON = 'top2'  # имя кнопки уменьшениия шага
# SET_AUTO_BUTTON = 'base2'    # имя кнопки установки автономки

MOVING_FORWARD = 1
MOVING_BACK = -1

TURN_UP_ROD = 1
TURN_DOWN_ROD = -1

TONG_GRASP = 1
UNCLASP_GRASP = -1

TURN_COUNTERCLOCKWISE_BUTTON = ''  # имя кнопки поворота против часовой стрелки на месте
TURN_CLOCKWISE_BUTTON = ''  # имя кнопки поворота по часовой стрелке на месте
FORWARD_BUTTON = ''  # имя кнопки движения робота вперед
BACK_BUTTON = ''  # имя кнопки движения робота назад
TURN_FORWARD_STICK = ''  # имя поворотного стика (левый стик горизонтальная ось) (передняя часть робота)
TURN_BACK_STICK = ''  # имя поворотного стика(задняя часть робота) Пока не используется
MOVE_STICK = ''  # имя стика движения робота вперед/назад (левый стик вертикальная ось)

SPEED_CHANGE_STEP = 10  # размер шага изменения максимальной, при прибавлении или уменьшении с кнопки
ADD_SPEED_BUTTON = ''  # имя кнопки прибавления скорости (под правый указательный верхняя)
SUB_SPEED_BUTTON = ''  # имя кнопки уменьшениия скорости (под правый указательный нижняя)
SET_AUTO_BUTTON = ''  # имя кнопки включения автономки (или под левый указательный нижняя или в середке какая то)
# TODO: еще необ добавить кнопку под светодиодики (успеть бы прилепить их куда-нибудь)
ENABLE_LED_BUTTON = ''  # имя кнопки включения светодиодов

#   Управление манипулятором
SET_MANIPULATOR_BUTTON = ''  # имя кнопки установки манипулятора в сложенное состояние(компактное) (под левый указательный верхняя)
TURN_BASE_STICK = ''  # имя стика поворота основания манипулятора (правый стик горизонтальная ось)
TURN_CRANK_STICK = ''  # имя стика поворота кривошипом манипулятора (правый стик вертикальная ось)
ROD_UP_BUTTON = ''  # имя кнопки поворота схвата манипулятора вверх (треугольник)
ROD_DOWN_BUTTON = ''  # имя кнопки поворота схвата манипулятора вниз (крестик)
TONG_GRASP_BUTTON = ''  # имя кнопки сжатия схвата манипулятора (кругляш)
UNCLASP_GRASP_BUTTON = ''  # имя кнопки разжатия схвата манипулятора (квадратик)

