IP = "173.1.0.22"  # TODO: поменять айпишник на айпишник малины, которая будет стоять на роботе
PORT = 8000

SEND_DELAY = 0.05  # время задержки отправки новых данных
# TURN_STICK = 'z'  # имя поворотного стика(передняя часть робота)
# ROTATE_STICK = 'y'  # имя стика разворота на месте
# MOVE_STICK = 'rz'  # имя стика движения робота
# SPEED_CHANGE_STEP = 10  # размер шага изменения максимальной, при прибавлении или уменьшении с кнопки
# ADD_SPEED_BUTTON = 'pinkie'  # имя кнопки прибавления скорости
# SUB_SPEED_BUTTON = 'top2'  # имя кнопки уменьшениия шага
# SET_AUTO_BUTTON = 'base2'    # имя кнопки установки автономки

MOVING_FORWARD = 1
MOVING_BACK = -1

TURN_UP_ROD = 1
TURN_DOWN_ROD = -1

TONG_GRASP = 1
UNCLASP_GRASP = -1

ROTATE_STICK = 'hat0x'  # имя стика поворота робота на месте (горизонтальная ось креста)
TURN_FORWARD_STICK = 'x'  # имя поворотного стика (левый стик горизонтальная ось) (передняя часть робота)
MOVE_STICK = 'y'  # имя стика движения робота вперед/назад (левый стик вертикальная ось)
MOVE_STICK_CROSS = 'hat0y'  # имя стика движения робота вперед/назад (вертикальная ось креста)

SPEED_CHANGE_STEP = 10  # размер шага изменения максимальной, при прибавлении или уменьшении с кнопки
ADD_SPEED_BUTTON = 'thumbr'  # имя кнопки прибавления скорости (правый стик)
SUB_SPEED_BUTTON = 'thumbl'  # имя кнопки уменьшениия скорости (левый стик)
SET_AUTO_BUTTON = 'start'  # имя кнопки включения автономки (START)
# TODO: еще необ добавить кнопку под светодиодики (успеть бы прилепить их куда-нибудь)
# ENABLE_LED_BUTTON = ''  # имя кнопки включения светодиодов

#   Управление манипулятором
SET_MANIPULATOR_BUTTON = 'tl'  # имя кнопки установки манипулятора в сложенное состояние(компактное) (под левый указательный верхняя)
TURN_BASE_STICK = 'rx'  # имя стика поворота основания манипулятора (правый стик горизонтальная ось)
TURN_CRANK_STICK = 'ry'  # имя стика поворота кривошипом манипулятора (правый стик вертикальная ось)
ROD_UP_BUTTON = 'y'  # имя кнопки поворота схвата манипулятора вверх (y)
ROD_DOWN_BUTTON = 'a'  # имя кнопки поворота схвата манипулятора вниз (A)
TONG_GRASP_BUTTON = 'b'  # имя кнопки сжатия схвата манипулятора (B)
UNCLASP_GRASP_BUTTON = 'x'  # имя кнопки разжатия схвата манипулятора (X)

